In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv("C:\\Users\\ASUS\\OneDrive\\Desktop\\pandas\\tips.csv")

## How big is the data ?

In [4]:
df.shape

(244, 7)

## How does the data look like ?

In [5]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [6]:
df.sample(5)

     total_bill   tip   sex smoker   day    time  size
69        15.01  2.09  Male    Yes   Sat  Dinner     2
98        21.01  3.00  Male    Yes   Fri  Dinner     2
148        9.78  1.73  Male     No  Thur   Lunch     2
231       15.69  3.00  Male    Yes   Sat  Dinner     3
70        12.02  1.97  Male     No   Sat  Dinner     2

## What is the data type of columns ?

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

### ARE there any missing values ?

In [8]:
 df.isnull().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

## How does the data look methematicallyc?

In [9]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

## are there duplicate values ?

In [10]:
df.duplicated().sum()

1

## How is the correlation between columns ?

In [ ]:
df.corr()['column_name']